[
    {
        "Code": "NFA",
        "Group": "NFA",
        "Title": "No Further Action",
        "Description": "Incident reviewed, no further action required",
        "Example": "Used when no driver is deemed predominantly at fault or the incident is considered a racing incident.",
        "Who": "N/A",
        "Penalty": "None"
    },
    {
        "Code": "RP1mi",
        "Group": "RP1",
        "Title": "Unsafe Track Rejoin",
        "Description": "Driver rejoined the track unsafely but caused minimal effect to others. Only slight disruption, minimal time loss, and no damage to surrounding cars.",
        "Example": "Driver spins at a corner, rejoins slowly and cleanly, causing a car behind to slightly lift but no loss of position.",
        "Who": "Rejoining driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP1st",
        "Group": "RP1",
        "Title": "Unsafe Track Rejoin",
        "Description": "Driver rejoined the track unsafely, forcing other drivers to take avoiding action and/or causing noticeable time loss or a lost position. May include minor car damage.",
        "Example": "Driver rejoins at racing speed into a corner, forcing two cars behind to brake heavily and one loses a position avoiding contact.",
        "Who": "Rejoining driver",
        "Penalty": "30s"
    },
    {
        "Code": "RP1se",
        "Group": "RP1",
        "Title": "Unsafe Track Rejoin",
        "Description": "Driver rejoined dangerously into traffic, causing a collision, spin, or significant damage to one or more cars. Major time loss or multi-car incident.",
        "Example": "Driver rejoins onto racing line blindly and is hit by oncoming traffic, causing a major collision and multiple damaged cars.",
        "Who": "Rejoining driver",
        "Penalty": "DQ"
    },
    {
        "Code": "RP2mi",
        "Group": "RP2",
        "Title": "Unsafe Pit Exit - Crossing pit line",
        "Description": "Driver exited the pit lane unsafely but caused minimal effect to others. No avoidance required, minimal time loss, and no damage to surrounding cars.",
        "Example": "Driver crosses the pit exit line but no cars are nearby and no impact occurs.",
        "Who": "Exiting driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP2st",
        "Group": "RP2",
        "Title": "Unsafe Pit Exit - Crossing pit line",
        "Description": "Driver exited the pit lane unsafely, forcing other drivers to take avoiding action and/or causing noticeable time loss or a lost position. May include minor car damage.",
        "Example": "Driver exits pit lane into side-by-side traffic at Turn 1, forcing another car onto the curb and losing time.",
        "Who": "Exiting driver",
        "Penalty": "30s"
    },
    {
        "Code": "RP2se",
        "Group": "RP2",
        "Title": "Unsafe Pit Exit - Crossing pit line",
        "Description": "Driver exited the pit lane dangerously into oncoming traffic, causing a collision, spin, or significant damage to one or more cars. Major time loss or multi-car involvement.",
        "Example": "Driver merges directly into the racing line with a car fully alongside, causing a crash and severe damage.",
        "Who": "Exiting driver",
        "Penalty": "DQ"
    },
    {
        "Code": "RP3mi",
        "Group": "RP3",
        "Title": "Blue Flag Abuse / Blocking While Lapped",
        "Description": "Driver did not yield withing specified time frame under blue flags but caused minimal delay and no competitive impact.",
        "Example": "Lapped car hesitates to move aside for a faster car despite having multiple opportunities but only delays by half a small amount.",
        "Who": "Lapped driver",
        "Penalty": "5s"
    },
    {
        "Code": "RP3st",
        "Group": "RP3",
        "Title": "Blue Flag Abuse / Blocking While Lapped",
        "Description": "Driver ignored blue flags for an extended time, blocking faster cars and causing notable time loss or affecting battles.",
        "Example": "Lapped car doesn’t yield within the specified time frame, holding up a lead-lap driver and costing them multiple seconds",
        "Who": "Lapped driver",
        "Penalty": "15s"
    },
    {
        "Code": "RP3se",
        "Group": "RP3",
        "Title": "Blue Flag Abuse / Blocking While Lapped",
        "Description": "Deliberate blocking or interference under blue flags causing contact, damage, or major positional or time impact.",
        "Example": "Lapped car aggressively defends/attacks or causes contact, ruining a race for driver(s) on the lead lap.",
        "Who": "Lapped driver",
        "Penalty": "DQ"
    },
    {
        "Code": "RP4mi",
        "Group": "RP4",
        "Title": "Formation Lap / Start Line Infingement",
        "Description": "Occurs before race start on formation lap before lights",
        "Example": "nan",
        "Who": "Driver out of position",
        "Penalty": "30s"
    },
    {
        "Code": "RP4st",
        "Group": "RP4",
        "Title": "Formation Lap / Start Line Infingement",
        "Description": "Occurs before race start on formation lap before lights",
        "Example": "nan",
        "Who": "Driver out of position",
        "Penalty": "30s"
    },
    {
        "Code": "RP4se",
        "Group": "RP4",
        "Title": "Formation Lap / Start Line Infingement",
        "Description": "Occurs before race start on formation lap before lights",
        "Example": "nan",
        "Who": "Driver out of position",
        "Penalty": "DQ"
    },
    {
        "Code": "RP5mi",
        "Group": "RP5",
        "Title": "Illegal Overtake (Off-Track or Gained Advantage)",
        "Description": "Driver left the track and gained a small advantage (time or momentum) but returned the position immediately and safely after the incident. Little to no impact on the affected driver’s race.",
        "Example": "Driver cuts Turn 1 chicane and overtakes but gives the place back immediately",
        "Who": "Overtaking driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP5st",
        "Group": "RP5",
        "Title": "Illegal Overtake (Off-Track or Gained Advantage)",
        "Description": "Driver left the track to complete or defend an overtake and did not give the position back, resulting in a noticeable time or position disadvantage to another driver.",
        "Example": "Driver runs wide off-track  to complete a pass and keeps the position",
        "Who": "Overtaking driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP5se",
        "Group": "RP5",
        "Title": "Illegal Overtake (Off-Track or Gained Advantage)",
        "Description": "Driver left track limits to gain a major advantage or complete an overtake that results in a collision, spin, heavy damage, or has a major impact on multiple competitors. Advantage deliberately taken or significantly alters race outcome.",
        "Example": "Driver cuts a corner(s), passes multiple cars and gains unfair advantage or affects another drivers race.",
        "Who": "Overtaking driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP6mi",
        "Group": "RP6",
        "Title": "Late Blocking / Moving Under Braking (multiple defensive moves)",
        "Description": "Driver made a late defensive move under braking that caused minor disruption but did not cause significant time loss, position change, or damage. Other driver was able to continue safely with only slight avoidance required.",
        "Example": "nan",
        "Who": "Defending driver",
        "Penalty": "5s"
    },
    {
        "Code": "RP6st",
        "Group": "RP6",
        "Title": "Late Blocking / Moving Under Braking (multiple defensive moves)",
        "Description": "Driver made a late defensive move under braking that forced another competitor to take significant avoiding action, leave the track, lose time, or lose a position. May include minor contact or minor damage.",
        "Example": "nan",
        "Who": "Defending driver",
        "Penalty": "30s"
    },
    {
        "Code": "RP6se",
        "Group": "RP6",
        "Title": "Late Blocking / Moving Under Braking (multiple defensive moves)",
        "Description": "Driver unjustifiably moved under braking in a dangerous or reckless manner, causing a collision, heavy damage, spin, or multi-car incident. Highly unsafe defensive driving with major race impact.",
        "Example": "nan",
        "Who": "Defending driver",
        "Penalty": "DQ"
    },
    {
        "Code": "RP7mi",
        "Group": "RP7",
        "Title": "Divebomb / Overly Ambitious Lunge",
        "Description": "Driver attempted a lunge from too far back but made only light contact, and the affected driver experienced minimal time loss or impact. No damage and both cars continued safely.",
        "Example": "Driver lunges late into a corner, lightly bumps rear bumper, both continue safe",
        "Who": "Overtaking driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP7st",
        "Group": "RP7",
        "Title": "Divebomb / Overly Ambitious Lunge",
        "Description": "Driver attempted an unrealistic overtake from too far back, forcing the other driver off-line, off track, or resulting in noticeable time loss or a lost position(s). May include minor contact or minor damage.",
        "Example": "Divebomb into hairpin forces other car wide, losing multiple positions",
        "Who": "Overtaking driver",
        "Penalty": "30s"
    },
    {
        "Code": "RP7se",
        "Group": "RP7",
        "Title": "Divebomb / Overly Ambitious Lunge",
        "Description": "Reckless or dangerous overtake attempt from an unreasonable distance resulting in heavy contact, a spin, severe damage, or a multi-car incident. Major disruption to other competitors’ races.",
        "Example": "Lunge from multiple car lengths back causes a full spin and multi-car crash",
        "Who": "Overtaking driver",
        "Penalty": "DQ"
    },
    {
        "Code": "RP8mi",
        "Group": "RP8",
        "Title": "Rear-End Collision (Braking Zone)** remove braking zone**",
        "Description": "Driver made light rear contact under braking or on corner entry/exit, causing minimal effect to the car ahead. No position change, minimal time lost, and no damage.",
        "Example": "Light tap in braking zone due to misjudged distance, no harm done",
        "Who": "Driver behind",
        "Penalty": "5s"
    },
    {
        "Code": "RP8st",
        "Group": "RP8",
        "Title": "Rear-End Collision (Braking Zone)** remove braking zone**",
        "Description": "Driver misjudged braking or attempted an unrealistic move, causing the car ahead to leave the racing line, lose time, or lose position(s). May cause minor damage.",
        "Example": "Driver brakes late and pushes car ahead wide, losing time and position(s)",
        "Who": "Driver behind",
        "Penalty": "15s"
    },
    {
        "Code": "RP8se",
        "Group": "RP8",
        "Title": "Rear-End Collision (Braking Zone)** remove braking zone**",
        "Description": "Driver caused a heavy contact from behind resulting in a spin, crash, significant damage, or multi-car involvement. Major race impact or DNF-level damage.",
        "Example": "Heavy contact at braking zone causing spin and major damage",
        "Who": "Driver behind",
        "Penalty": "SG30"
    },
    {
        "Code": "RP9mi",
        "Group": "RP9",
        "Title": "Squeezing Off Track / Not Leaving Room",
        "Description": "Driver failed to leave adequate racing room, causing the other car to place wheels off track but resulting in minimal time loss and no contact or damage. Both drivers continue safely and positions remain unchanged.",
        "Example": "Driver edges competitor to outer curb forcing 2 wheels off track, battle continues clean",
        "Who": "Defending driver",
        "Penalty": "5s"
    },
    {
        "Code": "RP9st",
        "Group": "RP9",
        "Title": "Squeezing Off Track / Not Leaving Room",
        "Description": "Driver forced another car fully off track or onto runoff, causing noticeable time loss or a position loss, or minor contact/damage. Clear failure to allow a car with racing overlap space to compete fairly.",
        "Example": "Driver pushes competitor fully off track causing time and position loss",
        "Who": "Defending driver",
        "Penalty": "15s"
    },
    {
        "Code": "RP9se",
        "Group": "RP9",
        "Title": "Squeezing Off Track / Not Leaving Room",
        "Description": "Driver aggressively or dangerously forced another car off track, causing a spin, heavy damage, collision, or multi-car incident. Highly unsafe and significantly affects race outcome.",
        "Example": "Driver squeezes another into wall/grass causing severe damage or crash",
        "Who": "Defending driver",
        "Penalty": "SG30"
    },
    {
        "Code": "RP10mi",
        "Group": "RP10",
        "Title": "Excessive flashing",
        "Description": "Driver repeatedly flashed headlights in an aggressive or sustained manner that distracted another driver, influenced their driving line, or affected a battle on track.",
        "Example": "nan",
        "Who": "Overtaking Driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP10st",
        "Group": "RP10",
        "Title": "Excessive flashing",
        "Description": "Driver repeatedly flashed headlights in an aggressive or sustained manner that distracted another driver, influenced their driving line, or affected a battle on track.",
        "Example": "nan",
        "Who": "Overtaking Driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP10se",
        "Group": "RP10",
        "Title": "Excessive flashing",
        "Description": "Driver repeatedly flashed headlights in an aggressive or sustained manner that distracted another driver, influenced their driving line, or affected a battle on track.",
        "Example": "nan",
        "Who": "Overtaking Driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP11mi",
        "Group": "RP11",
        "Title": "Intentional Ramming",
        "Description": "Remove",
        "Example": "nan",
        "Who": "nan",
        "Penalty": "DQ"
    },
    {
        "Code": "RP11st",
        "Group": "RP11",
        "Title": "Intentional Ramming",
        "Description": "Driver clearly and deliberately used their car to cause a major collision, spin, heavy damage, retaliation event, or multi-car crash. Dangerous and unsportsmanlike conduct with significant race consequence.",
        "Example": "nan",
        "Who": "nan",
        "Penalty": "DQ"
    },
    {
        "Code": "RP11se",
        "Group": "RP11",
        "Title": "Intentional Ramming",
        "Description": "Remove",
        "Example": "nan",
        "Who": "nan",
        "Penalty": "DQ"
    },
    {
        "Code": "RP12mi",
        "Group": "RP12",
        "Title": "Driver Connection issue",
        "Description": "Driver experienced temporary connection instability causing brief lag or car warping, but with minimal impact to other drivers. No avoidance required, no damage, and racing continued safely.",
        "Example": "Car warps slightly on straight but no one nearby is affected",
        "Who": "Driver",
        "Penalty": "10s"
    },
    {
        "Code": "RP12st",
        "Group": "RP12",
        "Title": "Driver Connection issue",
        "Description": "Driver’s unstable connection interfered with another car’s race, forcing avoidance, causing time loss, or making racing unsafe. Driver did not attempt to resolve or ignored requests to pit/retire.",
        "Example": "Warping car in a battle causes other drivers to react and lose time",
        "Who": "Driver",
        "Penalty": "20s"
    },
    {
        "Code": "RP12se",
        "Group": "RP12",
        "Title": "Driver Connection issue",
        "Description": "Driver’s connection repeatedly caused major incidents, collision risk, or contact due to warping, making racing unsafe for the field.",
        "Example": "Car teleports into another causing major crash and safety concern",
        "Who": "Driver",
        "Penalty": "30s"
    },
    {
        "Code": "RP13mi",
        "Group": "RP13",
        "Title": "Wreckless driving",
        "Description": "Driver displayed unsafe driving behavior or poor control that created minor unnecessary risk, but resulted in minimal impact and no time loss or damage to others.",
        "Example": "nan",
        "Who": "Driver",
        "Penalty": "10s"
    },
    {
        "Code": "Rp13st",
        "Group": "nan",
        "Title": "Wreckless Driving",
        "Description": "Driver engaged in unsafe, unpredictable, or aggressive actions that impacted another driver’s race, forcing avoidance, causing noticeable time loss, or minor damage.",
        "Example": "nan",
        "Who": "Driver",
        "Penalty": "30s"
    },
    {
        "Code": "RP13se",
        "Group": "RP13",
        "Title": "Wreckless Driving",
        "Description": "Any driver that has multiple penalties applied from incidents in a race",
        "Example": "nan",
        "Who": "Driver",
        "Penalty": "DQ"
    }
]
